1. Добавить отчет;
2. В свойствах отчета Хранилище вариантов = "Хранилище вариантов отчетов";
3. В модуле менеджера добавить: 

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	
	НастройкиОтчета.Описание = НСтр("ru = 'Анализ перевозки вагонами по рейсам.'");	
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализПеревозкиВагонамиПоРейсам");
	НастройкиВарианта.Описание = НСтр("ru = 'Анализ перевозки вагонами по рейсам.'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

4. Добавить отчет в ОМ.ВариантыОтчетовПереопределяемый
5. В схеме компановки исправить:
	5.1. Макет оформления "Управление транспортом и перевозками"
	5.2. Выводить заголовок:Выводить
	5.3. Установить заголовок отчета
	5.4. Задать имя варианта отчета и представление
6. Запустить базу с ключем "/C ЗапуститьОбновлениеИнформационнойБазы"
