БСП 2.3.6
Добавление отчета, с подключением к подсистеме "Варианты отчетов"
------------------------------------------------------------------------------------------------------------------------------------
1. Добавить отчет;
2. Выключить флаг "Использовать стандартные команды"; (отчет будет доступен через пункт отчеты, соответствующей подсистемы)
3. Добавить отчет в нужную подсистему;
4. Включить флаг "Включать в содержание справки", написать краткую справку, если писать нечего, то хотя бы "Отчет "Наименование""; (Если конфа. готовится для совместимо с 1с)
5. В свойствах отчета Хранилище вариантов = "Хранилище вариантов отчетов";
6. В модуле менеджера добавить: 

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	
	НастройкиОтчета.Описание = НСтр("ru = 'Анализ перевозки вагонами по рейсам.'");	
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализПеревозкиВагонамиПоРейсам");
	НастройкиВарианта.Описание = НСтр("ru = 'Анализ перевозки вагонами по рейсам.'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

7. Добавить отчет в ОМ.ВариантыОтчетовПереопределяемый процедура "НастроитьВариантыОтчетов"
8. В схеме компановки исправить:
	8.1. Макет оформления "Управление транспортом и перевозками"
	8.2. Выводить заголовок:Выводить
	8.3. Установить заголовок отчета
	8.4. Задать имя варианта отчета и представление
9. Если необходимо:
	9.1 Добавить параметр "СтандартныйПериод"
	9.2 Для параметров "ДатаНачала", "ДатаОкончания" отключить достпность и настроить выражения &СтандартныйПериод.ДатаНачала, &СтандартныйПериод.ДатаОкончания
	9.3	Изменить заголовок на "Период"
	9.4 В параметрах настроить период по умолчанию
10. Запустить базу с ключем "/C ЗапуститьОбновлениеИнформационнойБазы"

